# Pandas 
```
pip install pandas 
pip install --upgrade pandas
```
- Pandas Series
- Pandas DataFrame --> use various ways to initialize it(dtype,columns,index)
- shape
- head
- tail
- convert to numpy array --> values
- columns
- to_csv (index = false)
- read_csv
-  drop(columns=[])
-  describe()
-  info()
-  iloc
-  loc
-  Access Particular Columns
-  indexing and slicing --> multirow and col
-  columns.get_loc
-  Fancy indexing
-  Filtering
-  unique
-  sort_values(by,ascending)
-  getdummies 
- groupby --> column name, various functions on grp, iterate
- pivot --> summarize and aggregate data,Grouper
- concat--> give as list, ignore_index,join
- merge--> on,how
- dropna
- fillna
- interpolate
- pip install matplotlib

In [8]:
import pandas as pd

In [2]:
print(pd.__version__)

2.2.3

In [15]:
l = [1,2,3,4,5,6]
pds = pd.Series(l,index=[10,20,30,40,50,60],name="Rohit")

In [16]:
pds[10]

np.int64(1)

In [19]:
pds

10    1
20    2
30    3
40    4
50    5
60    6
Name: Rohit, dtype: int64

In [14]:
type(pds)

pandas.core.series.Series

In [20]:
marks = {
    "Phy": [95,89,93,87],
    "Chem": [85,98,70,89],
    "Maths": [75,87,93,100]
}

In [21]:
marks

{'Phy': [95, 89, 93, 87], 'Chem': [85, 98, 70, 89], 'Maths': [75, 87, 93, 100]}

In [38]:
df = pd.DataFrame(marks,index = ["Rohit","Pratibha","Ritu","Devansh"])

In [39]:
df

          Phy  Chem  Maths
Rohit      95    85     75
Pratibha   89    98     87
Ritu       93    70     93
Devansh    87    89    100

In [36]:
l = [[10,20,30],[40,50,60]]

In [55]:
ldf = pd.DataFrame(l,columns=["A","B","C"],dtype='i')

In [56]:
ldf

    A   B   C
0  10  20  30
1  40  50  60

In [57]:
ldf.shape

(2, 3)

In [58]:
df.shape

(4, 3)

In [63]:
df.head(10)

          Phy  Chem  Maths
Rohit      95    85     75
Pratibha   89    98     87
Ritu       93    70     93
Devansh    87    89    100

In [66]:
df.tail(2)

         Phy  Chem  Maths
Ritu      93    70     93
Devansh   87    89    100

In [68]:
na = df.values

In [69]:
na

array([[ 95,  85,  75],
       [ 89,  98,  87],
       [ 93,  70,  93],
       [ 87,  89, 100]])

In [70]:
type(na)

numpy.ndarray

In [71]:
df

          Phy  Chem  Maths
Rohit      95    85     75
Pratibha   89    98     87
Ritu       93    70     93
Devansh    87    89    100

In [72]:
df.columns

Index(['Phy', 'Chem', 'Maths'], dtype='object')

In [74]:
na[2,1]

np.int64(70)

In [76]:
na[2][1]

np.int64(70)

In [78]:
df

          Phy  Chem  Maths
Rohit      95    85     75
Pratibha   89    98     87
Ritu       93    70     93
Devansh    87    89    100

In [80]:
df["Phy"]

Rohit       95
Pratibha    89
Ritu        93
Devansh     87
Name: Phy, dtype: int64

In [81]:
df[["Phy","Chem"]]

          Phy  Chem
Rohit      95    85
Pratibha   89    98
Ritu       93    70
Devansh    87    89

In [87]:
df.loc[["Rohit","Ritu"],["Phy","Maths"]]

       Phy  Maths
Rohit   95     75
Ritu    93     93

In [89]:
df.iloc[1,1]

np.int64(98)

In [95]:
df.iloc[0:3,0:3]

          Phy  Chem  Maths
Rohit      95    85     75
Pratibha   89    98     87
Ritu       93    70     93

In [94]:
df.iloc[[0,2],[0,2]]

       Phy  Maths
Rohit   95     75
Ritu    93     93

In [112]:
df.to_csv("marks.csv",sep='|',index=False)

In [125]:
# newDf = pd.read_csv("marks.csv",index_col="Unnamed: 0",sep='|')
newDf = pd.read_csv("marks.csv",sep='|')

In [127]:
newDf

   Phy  Chem  Maths
0   95    85     75
1   89    98     87
2   93    70     93
3   87    89    100

In [128]:
newDf.index = [10,20,30,40] #To set index Values

In [129]:
newDf

    Phy  Chem  Maths
10   95    85     75
20   89    98     87
30   93    70     93
40   87    89    100

In [134]:
newDf.drop(["Phy"],axis = 1,inplace=True)

In [135]:
newDf

    Chem  Maths
10    85     75
20    98     87
30    70     93
40    89    100

In [136]:
df

          Phy  Chem  Maths
Rohit      95    85     75
Pratibha   89    98     87
Ritu       93    70     93
Devansh    87    89    100

In [137]:
df.describe()

             Phy       Chem      Maths
count   4.000000   4.000000    4.00000
mean   91.000000  85.500000   88.75000
std     3.651484  11.676187   10.59481
min    87.000000  70.000000   75.00000
25%    88.500000  81.250000   84.00000
50%    91.000000  87.000000   90.00000
75%    93.500000  91.250000   94.75000
max    95.000000  98.000000  100.00000

In [138]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Rohit to Devansh
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Phy     4 non-null      int64
 1   Chem    4 non-null      int64
 2   Maths   4 non-null      int64
dtypes: int64(3)
memory usage: 300.0+ bytes

In [139]:
df

          Phy  Chem  Maths
Rohit      95    85     75
Pratibha   89    98     87
Ritu       93    70     93
Devansh    87    89    100

In [143]:
df.columns.get_loc("Maths")

2

In [145]:
df

          Phy  Chem  Maths
Rohit      95    85     75
Pratibha   89    98     87
Ritu       93    70     93
Devansh    87    89    100

In [147]:
df.loc[["Pratibha","Devansh","Rohit","Ritu"],["Maths","Phy"]]

          Maths  Phy
Pratibha     87   89
Devansh     100   87
Rohit        75   95
Ritu         93   93

In [148]:
df.iloc[[1,3,0,2],[2,1]]

          Maths  Chem
Pratibha     87    98
Devansh     100    89
Rohit        75    85
Ritu         93    70

In [149]:
df.iloc[[True,False,True,False]]

       Phy  Chem  Maths
Rohit   95    85     75
Ritu    93    70     93

In [154]:
df[df['Phy'] >= 90]

       Phy  Chem  Maths
Rohit   95    85     75
Ritu    93    70     93

In [156]:
df[df['Chem']<=90]

         Phy  Chem  Maths
Rohit     95    85     75
Ritu      93    70     93
Devansh   87    89    100

In [2]:
df = pd.read_csv("weather_data_cities.csv")
df[df["event"] == "Rain"]

        day      city  temperature  windspeed event
0  1/1/2017  new york           32          6  Rain
7  1/4/2017    mumbai           92          5  Rain

-  unique
-  sort_values(by,ascending)
-  getdummies 
- groupby --> column name, various functions on grp, iterate
- pivot --> summarize and aggregate data,Grouper
- concat--> give as list, ignore_index,join
- merge--> on,how
- dropna
- fillna
- interpolate
- pip install matplotlib

In [5]:
import pandas as pd
import numpy as np

In [4]:
pd.unique(df['day'])

array(['1/1/2017', '1/2/2017', '1/3/2017', '1/4/2017'], dtype=object)

In [10]:
np.unique(df['day'].values,return_counts=True)

(array(['1/1/2017', '1/2/2017', '1/3/2017', '1/4/2017'], dtype=object),
 array([3, 3, 3, 3]))

In [12]:
df['temperature'].sort_values()

2     28
0     32
3     33
1     36
11    42
8     45
9     50
10    54
5     85
6     87
4     90
7     92
Name: temperature, dtype: int64

In [17]:
df.sort_values(by='windspeed',axis = 0,ascending=False)

         day      city  temperature  windspeed   event
8   1/1/2017     paris           45         20   Sunny
6   1/3/2017    mumbai           87         15     Fog
9   1/2/2017     paris           50         13  Cloudy
2   1/3/2017  new york           28         12    Snow
5   1/2/2017    mumbai           85         12     Fog
11  1/4/2017     paris           42         10  Cloudy
10  1/3/2017     paris           54          8  Cloudy
1   1/2/2017  new york           36          7   Sunny
3   1/4/2017  new york           33          7   Sunny
0   1/1/2017  new york           32          6    Rain
7   1/4/2017    mumbai           92          5    Rain
4   1/1/2017    mumbai           90          5   Sunny

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          12 non-null     object
 1   city         12 non-null     object
 2   temperature  12 non-null     int64
 3   windspeed    12 non-null     int64
 4   event        12 non-null     object
dtypes: int64(2), object(3)
memory usage: 612.0+ bytes

In [20]:
df.describe()

       temperature  windspeed
count    12.000000  12.000000
mean     56.166667  10.000000
std      25.044808   4.572646
min      28.000000   5.000000
25%      35.250000   6.750000
50%      47.500000   9.000000
75%      85.500000  12.250000
max      92.000000  20.000000

In [30]:
l = ['A','B','C','D','B','A','D','C']

In [31]:
pd.DataFrame(l)

   0
0  A
1  B
2  C
3  D
4  B
5  A
6  D
7  C

In [32]:
pd.get_dummies(l,dtype='i1',prefix='x')

   x_A  x_B  x_C  x_D
0    1    0    0    0
1    0    1    0    0
2    0    0    1    0
3    0    0    0    1
4    0    1    0    0
5    1    0    0    0
6    0    0    0    1
7    0    0    1    0

In [33]:
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [46]:
gdf = df.groupby('city')

In [47]:
for city, cdf in gdf:
    print(city)
    print(cdf)
    print()

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [48]:
gdf.max()

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [50]:
gdf.mean(numeric_only=True)

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [51]:
gdf.sum(numeric_only=True)

          temperature  windspeed
city
mumbai            354         37
new york          129         32
paris             191         51

In [54]:
gdf.agg(['min', 'max'])

               day           temperature     windspeed       event
               min       max         min max       min max     min    max
city
mumbai    1/1/2017  1/4/2017          85  92         5  15     Fog  Sunny
new york  1/1/2017  1/4/2017          28  36         6  12    Rain  Sunny
paris     1/1/2017  1/4/2017          42  54         8  20  Cloudy  Sunny

In [58]:
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [66]:
df.pivot(index='day',columns=['city'])

         temperature                windspeed                 event           \
city          mumbai new york paris    mumbai new york paris mumbai new york
day
1/1/2017          90       32    45         5        6    20  Sunny     Rain
1/2/2017          85       36    50        12        7    13    Fog    Sunny
1/3/2017          87       28    54        15       12     8    Fog     Snow
1/4/2017          92       33    42         5        7    10   Rain    Sunny


city       paris
day
1/1/2017   Sunny
1/2/2017  Cloudy
1/3/2017  Cloudy
1/4/2017  Cloudy

In [9]:
d1 = {
    'A':[10,20,30,40],
    'C':[1,2,3,4]
}
d2 = {
    'A':[30,40,50],
    'B':[3,4,5]
}

In [10]:
df1 = pd.DataFrame(d1)
df2 = pd.DataFrame(d2)

In [11]:
df1

    A  C
0  10  1
1  20  2
2  30  3
3  40  4

In [12]:
df2

    A  B
0  30  3
1  40  4
2  50  5

In [13]:
df3 = pd.concat([df1,df2],axis=0,ignore_index=True,join='outer')

In [14]:
df3

    A    C    B
0  10  1.0  NaN
1  20  2.0  NaN
2  30  3.0  NaN
3  40  4.0  NaN
4  30  NaN  3.0
5  40  NaN  4.0
6  50  NaN  5.0

In [15]:
df1.merge(df2,how='right')

    A    C  B
0  30  3.0  3
1  40  4.0  4
2  50  NaN  5

In [31]:
df1.mean(axis=None)

13.75

In [17]:
df2

    A  B
0  30  3
1  40  4
2  50  5